cultivioio-web/iot-water-managment/firmware/controller_node/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c6"

# Zigbee Coordinator configuration
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCZR=y

# IEEE 802.15.4 Radio
CONFIG_IEEE802154_ENABLED=y

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# FreeRTOS
CONFIG_FREERTOS_HZ=100

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# Stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
